# AssociatedTopographySurfaceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuildingPad..::..AssociatedTopographySurfaceId Property
BuildingPad Class See Also
---
The element id of a topography surface created by the introduction of this building pad.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId AssociatedTopographySurfaceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssociatedTopographySurfaceId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AssociatedTopographySurfaceId {
	ElementId^ get ();
}
```

# See Also
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace